[
1. Which of the following  banks has been listed as a Domestic Systemically  Important  Banks (DSIBs) by the Reserve bank of India?
(a) Punjab  National   Bank
(b) Bank  of Baroda
(c) HDFC  Bank
(d) Induslnd   Bank
C

2. The  Ministry   of Consumer   Affairs,   Food  and  Public  Dlstributi,en had launched  negotiable  warehousing  receipts  in electronic format.
Consider the following  in this regard:
1. The depositors  are bailee against com warehouses  for which documents  are issued by warehouses.
2. NWRs can be traded,  sold, swapped  and used as collateral  to support  borrowing  or loans from banks.
3. It is an important  step towards  doubling farmers'  income by 2022.
Which of the above statements  is/are correct?
(a) 1 only
(b) 2 and 3 only
(c) 1, 2 and 3 
(d). none
B

3. Which of toe following  statements  is/ are correct regarding  The Natiorial Agricultural  Higher Education  Project?
1. the project has been formulated  by the Ministry of Agriculture  & Farmers' Welfare  in partnership  with the World Bank.
2. Project Management  and Learning  is an important  component  of the project.
3. The project has been launched with 50:50 cost sharing  basis with the World Bank.
Select the correct answer using the code given below:
(A) 1 and 2 only
(b) 2 only
(c) 2 and 3 only
(d) 1 and 3 only
C

4. Bharat 22 is the second  ETP (Exchanqe  Traded Fund launched  by the Government  of India. Conside   tHe following  in this regard:
1. ETF's are more liquid than mutual funds as they can be sold quickly on stock exchanges.
2. Bharat 22 comprises  of 2,2..stocks  and is managed  by SBI Blue­chip Fund.
3. It gives hiqhest sector wise weightage  to energy. Which of the above statements  is/are correct?
(a) 1 only
(b) 1 and 2 only
(c) ~ only
(d) 2 and 3 only
A
5. Which of the following  are the features  of the Hydrocarbon Exploration  and Licensing  Policy (HELP)?
1. Uniform license
2. An open acreage  policy
3. Profit sharing  model
4. Marketing  and pricing freedom
Select the correct answer using the code given below: 
(a) 1, 2 and 3 only
(b) Only 1, 2 and 4
(c) Only 1, 3 and 4
(d) 1, 2, 3 and 4
B

6. Consider  the following  statements  regarding  the Pradhan  Mantri

Vaya Vandana Yojana (PMVVY):

1. It is a pension scheme  launched  by the Ministry of Social Justice and Empowerment.
,
2. It is operated  by Life Insurance Company  in collaboration  with the

National  lnsurance  Company  (NIC).

3. The scheme also offers loan up to 75% of the purchase  price after

3 policy years.

Which of the above statements  is/are incorrect? 
(A) 1 and 2 only
(b) 2 and 3 only
(c) 1 and 3 only
(d) 1, 2 and 3
 A
 
7. Consider  the following  statements  regarding the Jute-ICARE project:
1. It has been launched  by the Ministry of Textiles to double the income of jute farmers.
2. A microbial  consortium  called SONA has been developed  by the
National Jute Board under Jute-ICARE  project.                         ,
3. Retting is a process  in which jute is placed in Itquid S0 as to promote tightening  of the fibres in the wC{_odtyissue:
Which of the above statements  is/are correct? (a) 1 only
(b) 1 and 2 only
(c) 2 and 3 only
(d) 1, 2 and 3
A

8. Administeres   Priee MeCh;ri'Sm  (APM) for petrol and diesel was dismantled  by the government  in 2017. Consider the following statements:
1. In dynamic fuel priclnq, the oil retailers fortnightly  revise the retail selling prices of petrol and diesel.
2. In In.dia, the dynamic fuel pricing has been introduced for fixing the petrol prices only.
Whi~h of the following  statements  is/are correct?
(a) 1 only
(b) 2 only
(c) Both 1 and 2
(d) Neither 1 nor 2
D

9. Which of the following  statements  is/ are correct regarding the Innovate  in India (i3) project?
1. 13is a flagship  program of the Government  of India under the National Biopharma  Mission.
2. It has been launched  by the Union Ministry of Science  &  ,­ Technology  in collaboration  with World Bank.
Select the correct answer using the code gj,ven below: 
(a) 1 only
(b) 2 only
(c) Both 1 and 2
(d) Neither 1 nor 2
C

10. Consider the following  statem, ents  regarding  the Hill Area Development  Programme  (H,ADP):
1. The schem    aims     ensure equitable  development  of every area, tribe and ever.:ysection in the North Eastern Region.
2. It has been launched  by The Ministry for Development  of NorthEastern Region.
Which of the above statements  is/are correct?
(a) :t. only      r
(6) 2 only
(c) Both 1 and 2
(d) Neither  1 nor 2
C

11. Which of the following  statements  is/are correct regarding the National Policy on Marine Fisheries?
1. The policy is in line with the FAO's Code of Conduct for    X
Responsible  Fisheries on conservation,  development  and management  of fisheries.
2. The Policy has proposed  chip-based  smart registr:afion c~,n~Jsfor
fishermen  and their fishing vessels.
3. It focuses  on Species-specific  and area specific management plans with spatial and temporal  measures for sustainable  utilization of resources.
Select the correct answer using the code given below: 
(A) 1 and 2 only
(b) 2 and 3 only 
(c) 1 and 3 only 
(d) 1,2  and 3
D

12. With res~ect to lntormation  utilities(IU), consider the fellowinq:
1. It maintalns  information  of all financial  contracts  in a demat format.
2. Na ional E-Governance  Services  Limited (NeSL) is India's first Information  Utility.
Which of the above statements  is fare Incorrect? 
(a) 1 only
(b) 2 only
(c) Both 1 and 2
(d) Neither 1 nor 2
D

13. Which of the following  committees  has recommended  an overhaul  of corporate  governance  norms for listed firms?
(a) Bimal Julka Committee
(b) Vasudev Committee
(c) Tarapore Committee
(d) Uday Kotak Committee
D

14. Which of the following  statements  is correct regarding the Peer­to Peer lending (P2P)?
1. Peer-to Peer lending allows a business to sell its invoices at a discount to a pool of individual  or institutional  investors  for cash.
2. P2P platforms  are now trea a,d as non banking financial
companies  (NBfGs)  and thu,s,(egulated   by Securities  and Exchange
Board of India.
Select the correct answer using the code given below: 
(a) 1 only             ..
(b) 2 only
(c) Bot~ 1 and 2
(d) Neither 1 nor 2
D

15. With reference to 'Non Banking  Financial  Company  (NBFC), consider the following  statements:
1. NBFC is engaged  in loans and advances,  industrial  activity, the sale, purchase  or construction  of immovable  property.
2. NBFC is a company  registered  under the Companies  Act, 1956 of India.
3. The Reserve  Bank of India (RBI) launched the Ombudsman
Scheme for Non Banking Financial  Companies  (NBFC). Which of the statements  given above are correct?
(A) 1 and 2 only
(b) 2 and 3 only 
(c) 1 and 3 only 
(d) 1, 2 and 3
B

16. Various activities to promote  best practices  and enhance agriculture  income bein~ u  dertaken  under Krishi Kalyan Abhiyan are                                           ..
1. Distribution  of Soil Health' Cards to all farmers
2. Artificial  insemination  saturation
3. Demonstration  proqrarnmes  on Micro-irrigation WJqichof tlie statements  given above are correct? 
(A) 1 and 2 only
(b) 2 and 3 only 
(c) 1 and 3 only 
(d) 1, 2 and 3
D

17. 'Project Sashakt'has  been launched  is
(a) Personality  development  programme  through  social (or community)  service
(b) Comprehensive  medical care facilities  to Central Government employees  and their family members.
(c) One-time  cash incentive to pregnant women for insti~tional/home births through  skilled assistance.
(d) A scheme that aims to strengthen  the credit capaelty, credit culture and credit portfolio of public sector banks:
D

18. India's first 'freight village' will be developed  by
(a) The Inland Waterways  Authority  of India 
(b) The National Highways Authority  of India 
(c) The State government  of <Sujara
(d) National Bank for Agriculture and Rural Development
A

19.The Municipal  Bonds in India, which of the following  staterneptsqs/are  incorrect?
1. The market fOri municipal  bonds in India is almost non-existent unlike WS ariel many developing  countries.
2. Tfiir  vananthapurarn  Municipal  Corporation  was the first urban loeal body in India to issue tax-free  municipal  bonds.
3. RBI has mandated  guarantee  from the State Government  or Central Government  for issuing such bond.
Select the correct answer using the code given below. 
a) 2 only
(b) 1 and 3 only 
(c) 2 and 3 only
(d) 1, 2 and 3
C

20. With reference to special economic zone (SEZ) in India, consider the following  statements:
1. India's SEZ Policy was implemented  from 1991.
2. The Baba Kalyani led committee  was constituted  to study the existing  SEZ policy of India.
3. There is absence  of clear exit mechanisntfe>,r the SEZ developers in India.
Which of the statements  given above are correct? 
(A) 1 and 2 only
(b) 1 and 3 only
(d) 1, 2 and 3
C

21. Thirteenth  meeting of Group of The Twenty (G20) was recently held in
(a)argentina  Buenos Aires
(b) New York; USA
(c) Jakarta,  Indonesia
(d) Hyderabad,  India
A

22. With reference to The Kimberley  Process Certification  Scheme (KPCS), consider the following  statements:
1. KPCS Plenary 2018 was held in Brussels,  Belgium.
2. EU handed over the Chairmanship  of KPCS to India from 2019.
3. It is a non-binding  agreement  that imposes extensive requirements  on every participant  to remove conflict diamonds from the global supply chain.
Which of the statements  given above are correct? 
(A) 1 and 2 only
(b) 1 and 3 only
(c) 2 and 3 only
(d) 1, 2 and 3
A

23. Which cities of India were reqeQtly selected  by the United Nations to participate  in its Glooal Sustainable  Cities 2025 initiative?
(a) Pune and Amritsar
(b) Noida and Greater  Noida
(c) Varanasi and Mathhra
(d) Hyderabad  and Amravati
B

24. O~jectives  elf  India's Agriculture  Export Policy, 2018 are
1. To double agricultural  exports by 2030
2. To provide an institutional  mechanism  for pursuing  market access.
3. To diversify  export basket, destinations  and boost high value and value added agricultural  exports
Which of the statements  given above are correct? 
(a) 1 and 2 only
(b) 1 and  3 only
(c) 2 and  3 only
(d)1,2and3                                                                        ~
C

25. With reference to credit rating agency (CRA), consider the following  statements:                                                                      ,
1. Standard  & Poor's,  Moody's  and Fitch Ratings, also kn0wn as the big three.
2. A CRA is a company  that rates debtors and share holders.
3. Higher the credit rating, lower is the rat   of interest offered to the organization.
Which of the statements  given above are correct? 
(a) 1 and 2 only
(b) 1 and 3 only
(d) 1, 2 and 3
B

26. With reference to Foreign  Direct Investment  (FDI) in India, consider the fallowing  statements:
1. In.,diapermits not more than 26% FDI cap in defence through automatio  route.
2. Fligher FDI translates  into better infrastructure,  enhanced capacities  and greater self-reliance.
3. FDI usually involves participation  in management,  joint-venture, transfer  of technology  and expertise.
Which	of the  statements   given  above  are correct? 
(a) 1 and  2 only
(b) 2 and  3 only
(c) 1 and 3 only
(d) 1, 2 and 3
B

27. Development  Impact Bond (01) was recently launched  by
(a) UBS Optimums  Foundation,  British Asian Trust, Michael & Susan
Dell Foundation  and Tata Trust.
(b) World Bank
(c) International  monetary  Fund (IMF)
(d) Asian Infrastructure  Inves\menf  Bank (A"B)
A

28. Which country recently declared  Indian currency  notes of denominations  '200,  '500 anQ:2000  to be illegal?
(a) Bhutan
(b) Nepal
(c) Pakistan
(d) Bangladesh
B 

29.consider the following  statements:
1. lndia ranks fourth  in the world in terms of total installed wind power capacity.
2. Today, renewable  account for about 330/0 of India's primary energy consu mptions.
3. According  to the World Bank's report2018,  many of the world's largest energy consuming  countries  performed  poorly in renewable energy regulations  since 2010.
Which of the above statements  is/are incorrect? 
(a) 1 only
(b) 3 only
(c) 1 and 2 only
(d) 2 and 3 only
B

30. With reference to 'Angel Tax', conside    he following  statements:
1. It is a 30% tax that is levied Q(l the funtiing received by start-ups from an external investor.
2. Angel tax was introduced in"'20f8, with the purpose to check the dumping of goods
Which of the statements grv,efl above is / are incorrect?
(a) 1 only
(b) 2 only    
(c) Both 1 and 2
(d) either 1 nor 2
B

31. With reference to 'Prompt Corrective Action (PCA), consider the foil  wing statements:
1. PCA norms allow the regulator to place certain restrictions such as halting branch Expansion and stopping dividend payment.
2. Four public sector banks -   Bank of Maharashtra,  Corporation Bank, Allahabad  Bank and Bank of India are under the PCA framework  of the RBI.
Which of the statements  given above is / are correct?
(a) 1 only
(b) 2 only
(c) Both 1 and 2
(d) Neither  1 nor 2
C

32. Which state has been identified  as best peff,Prmer in Start-up
Ranking 2018 announced  by DIPP? 
(a) Pune
(b) Gujarat
(c) Maharashtra
(d) Bihar
B

33. With referemce to the recent decision taken by Central government  that has brought out the new FDI guidelines  for the e­ commerce,  consider the following  statements:
1. The QeW'~orms bar exclusive tie-ups  between e-commerce  firms that fo low the 'inventory  based model' and vendors  using their platform.       r
2. Now the cash back or services,  such as quick delivery, offered by
e-tailors  have to be applicable  to limited vendors only on their platforms.
Which of the statements  given above is/are correct?
(a) 1 only
(b) 2 only
(c) Both 1 and 2
(d) Neither 1 nor 2
D

34. Consider the following  statements:
1. The merger of Bank of Baroda, Vijaya Bank and Den...aBank will create the largest lender in the country.
2. More and more amalgamation  of poorly perfe>rming banks is the best solution to deal with NPA problem.
3. Four "R" philosophy  in the barking  sector are Restructure, Resolution,  Rationalisation  and Reform.
Which of the statements  given above is/are incorrect?
(a) 1 only
(b) 2 and 3 only
(c) 1 and 3 only
(d) 1, 2 and 3
D

35. With reference to 'E-way bill', consider the following  statements:
1. It is a document  required to be carried by a person in charge of the conveyance  carrying  any consignment  of goods of value exceeCling twenty fi ve thousand  rupees.
2. 'Any person can enroll and generate the e-way bill for movement of goods for his/ her own use.
Which of the statements  given above is / are correct?
(a) 1 only
(b) 2 only
(c) Both 1 and 2
(d) Neither 1 nor 2
B

36. With reference to 'National  Entrepreneurship  Awar:ds (NEA,), consider the following  statements:                                            
1. The awards are given to an entrepreneur  and in  ividual in order to inspire and promote growth of entrepreneurs  in India.
2. The winners  receive a trophy, certificate  and c-ash prizes.
3. Nominees  must be under the age of 40 years. Which of the statements  given above are correct?
(a) 1 and 2 only
(b) 2 and 3 only
(c) 1 and 3 only 
(d) 1, 2 and 3
D

37. Consider the following  statements:
1. The anntJal Employment-UnemploymentSurve   of bouseholds  by Labour Bureau found that there was an absolute  increase  in employment  during the period 2013-14  to
2015-16 .
2. The unemployment  rate among the uneducated  is higher compared  to the educated.
3. Jobs in government  are grown exponentially  in last 20years.
Which of the statements  given above is/are incorrect?
(a) 1 and 2 only
(b) 3 only
(c) 1 and 3 only
(d) 1, 2 and 3
D

38. With reference to 'Universal  Basic Income (UBlr,  consider the following  statements:
Universal  Basic Income (UBI) in the state.
2. Under it payments  can be in periodic or one time lump sum cash payment.
3. People become more ptoqustive  when they get a basic income.
Which of the statements  given statement is / are incorrect?
(a) 1 and 2 only 
(b) 2 and 3 only 
(c) 1 and 3 only
(d) 1, 2 and 3
A

39. With reference to 'Gold Monetization  Scheme',  consider  the folLowing statements:
1. Under it deposits  can be made by residents of India, mutual funds and exchange  trading funds registered  under SEBI.
2. Joint deposits  are allowed with a minimum  of two holders with no cap on the maximum  number.
3. There is maximum  limit of Rs. 5 Lakh investment  under this scheme.
(a) 1 and 2 only 
(b) 2 and 3 only
(c) 1 and 3 only
(d)1,2and3
A

40. Consider the following  statements:
1. Future of Consumption  in Fast-Growth  Consumer  Market report is released  by World Economic  Forum.
2. Nearly 85%   of India's GO!?  is,driven  by domestic  private consumption.
3. Consumption  led g owth increases the urban-rural  divide significantly.
Which of the statements  given above is/are incorrect? (a) 1 and 2 only
(b) 2 only.
(c) 1 and 3 only
(d)1, 2 and 3
C

41. Consider the following  statements:
1. The Global Housing Technology  Challenge  (GHTC) has been launched  by Ministry of Housing and Urban Affairs.
2. Conventional  construction  systems  (such as the use of brick and mortar) are fast paced, dependent  on natural resources  and have low carbon footprint.
Which of the statements  given above is/are correct?
(a) 1 only
(b) 2 only
(c) Both 1 and 2
(d) Neither 1 nor 2
A

42. With reference to 'World Banlss Ease of Doing Business  Index', consider the following  statements:
1. India has improved  its ranking in 2018.
2. Ease of Doing Business  Index measures  macro stability policies and development  of the fin{ncial  sector.
3. The report does not talk about the business  climate in a country as well as business  regulations.
Which of tl1e statements  given above is / are incorrect?
(a) 1 and 2 only
(b) 1 and 3 only
(c) 2 and 3 only
(d) None
C

43. With reference to 'Regional Comprehensive    Economic   Partnership (RCEP)   " consider   the following   statements:
1. Recently,   7th  Intersessional    ministerial   meeting  was  held  in Singapore.
2. It is viewed as an alternative  to the Trans Pacific Partnership(TPP).                                                                                              '
3. India is a member of RCEP.
Which of the statements  given above are correct?
(a) 1 and 2 only
(b) 2 and 3 only 
(c) 1 and 3 only
(d) 1, 2 and 3
D

44. With reference to 'tollrism,.irv India', consider the following statements:
1. Incredible  Inctja tourist  Facilitator  Certification  (IITFC) is an online certification  programme  launched  by the Ministry of Tourism.
2. Travel and tourism  is the 5th largest foreign exchange  earner for India.
Which  of the statements  given above are correct?
(a) 1 only
(b) 2  only
(c) Both 1 and 2
(d) Neither  1 nor 2
 A

45. Consider the following  statements:
1. Natural Gas is cheaper  as compared  with petrol.
2. India is third largest energy consumer  and fourth  biggest LNG importer in the world.
(a) 1 only
(b) 2 only
(c) Both 1 and 2
(d) Neither  1 nor 2
C

46. Consider the following  statements:
1. The Expert Committee  on lntegration  of Commodity  Spot and Derivatives  Markets was headed b¥ Ramesh  Chand.
2. The spot markets are flag    ~nted, geographically  dispersed  and primarily  regulated  by the statutory  regulator.
Which of the following  statements  is/are correct? 
(a) 1 only
(b) 2 only
(c) Both 1 and 2
(d) Neither 1 nor 2
A

41.With  reference to the latest ruling of the Securities  and Exchange Board of India (SEBI) on algorithm trading at commodity  derivatives exchanges,  consider the following:
1. Algorithmic  trading  refers to orders generated  at a super-fast speed by use of advanced  mathematical  models.
2. Co-location  services have been introduced  to cut costs an(j minimise or eliminate  delay in the execution  of trade orders.
Which of the above statements  is/are correct? 
(a) 1 only
(b) 2 only
(c) Both 1 and 2
(d) Neither  1 nor 2
C

48. With reference to investments  by Foreign Portfolio  Investors(FPls)  in Indian bonds, consider the following:
1. Aggregate  FPI investments  in a single government  bond can be made to 30% of outstanding  stock.
2. Clearing  Corpotation  of india Ltd. is a Qualified  Central Counter Party (QCCP)  by the Rese,{e  Bank of India. Which of the above statements  is/are incorrect? 
(a) 1 only             
(b) 2 only
(c) Bot~ 1 and 2
(d) Neither 1 nor 2
D

49. Consider the following  statements  in regard to the Agriculture Export Policy, 2018:
1. The policy aims to double agricultural  exports from present US$ 30+ Billion to US$ 60+ Billion by 2025.
2. Monitoring  Framework  at Centre with Agriculture  as the noaal Department  will be established  to oversee the implementation  of Agriculture  Export Policy.
3. 'Brand  India' will be set up to promote exports and establish a strong quality regime for exports.
Which of the above statements  is/are ineorlect?
(a) 1 and 2 only 
(b) 2 and 3 only 
(c) 3 only
(d) 1, 2 and 3
A

50. With reference to    Nutrient Based Subsidy (NBS) programme, consider the following  statemets:
1. A fixed amount of subsidy is provided for Phosphatic  and Potassic (P&K) fertilizers,  ex; ept for Urea, based on the nutrient content present in them.
2. The ideal NPK ratio for healthy soil should be 2:2:1.
3. EJFlderthis scheme,  Maximum  Retail Price (MRP) of fertilizers  is fixed. b}f"the state government.
Which of the above statements  is/are correct?
(a) 1 only
(b) 2 and 3 only
(c) 1 and 3 only
 (d) 1, 2 and 3
 A
 ]
