[
Practice MCQ  Part -  1
01. Which of the following  is the best description  of the term 'Asian Premium'  often seen in news?
a) It is the money which developed  countries  agreed to give to the poor countries  of Asia to avoid climate change.
b) Extra charges  being collected  by OPEC countries from Asian countries  when selling oil in comparison  to Western  countries.
c) The total amount of investments  Asian Countries  received from World Bank in two last decade.
d) The extra amount of FDI Asian Countries  received in last few years due to their population  and lack of development.
Answer B

02.  Consider the following  about 'Compact 2025':
1. It is an initiative for ending hunger and under nutrition by 2025.
2. It has  been started by Food Corporation  of India(FCI). Which of the statements  given above is/are correct?
a)1 only 
b) 2 only
c) Both 1 and 2 
d) Neither  1 nor 2
Answer A

03.  'Consumer  Confidence  Survey' often seen in the news is released  by:
a) NITI Aayog
b) Ministry of Commerce  and Industry 
c) The Reserve  Bank of India
d) Ministry of Consumer  Affairs
Answer C

04  Consider  the following  about 'Directorate of Revenue Intelligence':
1. It is the apex anti-money  laundering  agency of India.
2. It works under the Central Board of Indirect Taxes & Customs, Ministry of Finance, and Government  of India.
Which of the statements given above is/are correct?
a) 1 only 
b) 2 only
c) Both 1 and 2
d) either  1 nor 2
Answer B

05 Consider  the following  about 'Export Promotion  Council for Handicrafts':
1. It is a non-profit  organisation  established  under the Companies Act in the year 1986- 87.
2. It is an apex body of handicrafts  exporters  for promotion  of exports of Handicrafts  from country.
Which of the statements  given above is/are correct?
a) 1 only 
b) 2 only
c) Both 1 and 2
d) Neither 1 nor 2
Answer C

06. 'Generalised  System of Preference',    often seen in the news is:
a) A preferential  tariff system extended  by developed  countries  to developing  countries.
b) Non-discriminatory   trade policy commitment  offered by one country to another  on a reciprocal  basis.
c) A preferential  tariff system    extended  by India to African countries.
d) A generalized system ofttrrapping   consumer  preferences
Answer A

07. Consider the following about 'Global Real Estate Transparency Index':
1. The survey  is released  by United Nations Human Settlement Programme.
2. In the latest edition (2018) of index, India has moved up one place due to improvement  in market fundamentals,  policy reforms, and liberalisation of FDI.
Which of the statements  given above is/are correct?
a) 1 only
b) 2 only
c) Both 1 and 2
d) Neither  1 nor 2
Answer B

08.  Which of the following  best describes  'Liberalised  Remittance Scheme'  of RBI?                                                                            
a) All resident  individuals,  including  minors, are allowed to freely remit  up to USD 2,50,000 per financial  year (April-   March) for any permissible  current or capital account  transaction  or a combination  of both.
b) All non-resident  individuals,  including  minors, are allowed to freely remit up to USD 2, 50,000 per financial  year (April-   March) for any permissible  current or capital account ttansaction  or a combination  of both.
c) All resident  individuals,  excluing minors, are allowed to freely remit up to USD 2,5O,OOO7 financial  year (April-   March) for any permissible  current or capital account transaction  or a combination  of both.
d) All foreigners  are allowed to freely remit up to USD 2, 50,000 per financial  year. (april -  March) for any permissible  current or capital account  transaction  or a combination  of both.
Answer A

09. Which of the following  is the best description  of the term 'Mathew  Effect' sometimes  seen in news?
a) A social phenomenon  wherein  people who already  possess high economic  or social status continue to do so over time
b) A social phenomenon  wherein  people who possess high economic  or social status suddenly  lose that status.
c) A social phenomenon  wherein  people who possess low economic or social status improve their status over time
d) Convergence  of income between the poor and the rich.
Answer A

010. Which of the following  best describes  'No-Fly  List'?
a) It is a list prepared  by the government,  of people who are prohibited to travel through  airways.
b) It is a list prepared  by the government,  of aircrafts which are prohibited from flying.
c) It is a list prepared  by the government,  of zones where private aircrafts are prohibited  from entering.
d) It is a list prepared  by the qovernrnent  of types of drones which are prohibited from flyin~near:  government  premises.
Answer A

011. Consider trre following  about 'RAILMADAD':
1. It is a mobile app to register complaints  by passengers  through mobile phone/web;
2. It relays real time feedback  to passengers  on the status of redressal of their complaints  which of the statements  given above is/are correct?
a)1 only
b)2 only
c) Both 1 and 2
d) Neither 1 nor 2
Answer  C

012.  Consider the following  about 'Renewal  Energy Dialogue':
1. This dialogue  is organised  by Council on Energy, Environment and Water (CEEW).
2. It offers a platform for engaged  deliberations  on therole   of different stakeholders  in advancing  renewable  energy deployment,
balancing  both domestic  priorities  and international  mitigation ambitions  and commitments.
a) 1 only 
b) 2 only
c) Both 1 and 2
d) Neither  1 nor 2
Answer C

013.  Consider the following about  'Mission  Solar Charkha':
1. It is an initiative of The Ministry of New and Renewable  Energy(MNRE).      ..
2. Its main objective is to leverage  low-cost,  innovative  technologies and processes  for sustenance.
Which of the statements  given above is/are correct?
a) 1 only
b) 2 only
c) Both 1 and 2
d) Neither  1 nor 2
 Answer B

Q14. In which of the following  locations Strategic  Oil Reserves  have not been established?
a) Visakhapatnam
b) Mangalore
c) Padur
d) Ambala
Answer D

Q15. Which of the following  state qovernment  Has launched  'Surya Shakti Kisan Scheme'?
a) Uttar Pradesh 
b) Gujarat
c) Madhya  Pradesh
d) Rajasthan
Answer B

Q16. Consider the following  statements  about 'UDYAM SANGAM':
1. It is organised   The Mnistry of Corporate  Affairs.
2. The purpose-of  Conclave  is to encourage  dialogue  and partnership  among various stakeholders  of the MSME ecosystem and for promoting innovation  and knowledge  sharing on MSME related issues.
Which  of the statements  given above is/are correct?
a) 1 only
b)2 only
c) Both 1 and 2
d) Neither 1 nor 2
Answer B

Q17. Consider the following  statements  about 'Unorganised  Worker Identification  Number':
1. It is an initiative of The Ministry of Corporate  Affairs under Unorganized  Workers'  Social Security Act,
2008
2. It will improve unorganised  workers'  access to all social security schemes. Which of the statements  given above is/are-correct?
a) 1 only 
b) 2 only
c) Both 1 and 2
d) Neither  1 nor 2
AnswerB

Q18. Consider t~e foliowinfJ,about  'Water Productivity  Mapping of Major Indian Crops Report':
1. The report is released by Niti Aayog.
2. The report presents for the first time, maps on the water productivity Qf ten major Indian crops across cultivating  districts and states.
Which of the statements  given above is/are correct?
a)1 only 
b) 2 only
c) Both 1 and 2
d) Neither  1 nor 2
AnswerB

019.  Consider the following  about 'Zero Budget Natural Farming':
1. 'Zero Budgets' farming  promises to end a reliance on loans qnd drastically  cut production  costs, ending the debt cycle for desperate
farmers.
2. Under this initiative there is no use of chemicals.
3. The movement  first evolved  in KarnataKa.
Which of the statements  given above is/are correct?
a) 3 only
b) 1 and 2 only 
c) 2 only
d) All of the above
AnswerD

020.  With reference  to 'financlal stability report', consider the following  statements:               '
1. It is released  by the Ministry of Finance.
2. It reflects the overall assessment  of the stability of India's financial system ana its resilience to risks emanating  from global and
domestic  factors.
Whicti  of the statements  given above is/are correct?
a) 1 only 
b) 2 only
c) Both 1 and 2
d) Neither 1 nor 2
 AnswerB

Q21. With reference  to 'Prompt  Corrective Action (PCA) Framework',  consider the following  statements:
1. It is a set of guidelines  by the Securities  and Exchange  Board of India (SEBI) to private companies  for improving  their financial condition.
2. It is a framework  for improving the financial  condition  of th_;e' scheduled  commercial  banks.
Which of the statements  given above is/are-correct?
a) 1 only 
b) 2 only
c) Both 1 and 2
d) Neither  1 nor 2
AnswerB

Q22. What is/are possible factor,for depreciation  of rupees?
a) Rise in international crude-Sil prices. 
b) Tightening  of U.S.    onetary  policy
c) Both a and b
d) None of the above
AnswerC

'Q23. With reference  to 'Insolvency  and Bankruptcy  Code (IBC), 2016'  conslder the following  statements:
1. It deals primarily with insolvency  issues in the banking sector.
2. Timeline for Insolvency  resolution  process is 2 years under IBC,2016.
Which of the statements  given above is/are correct?
a) 1 only 
b) 2 only
c) Both 1 and 2
d) Neither 1 nor 2
AnswerD

024.  With reference  to 'Deposit  Insurance  and Credit Guarant,ee
Corporation (DICGC)" consider the following statements:   
1. It is a subsidiary of Life Insurance Cotporation,
2. It provides insurance to deposits up to ~0 lakhs. Which of the statements given above is/are correct? 
a) 1 only
b) 2 only
c) Both 1 and 2
d) Neither 1 nor 2   
AnswerD

025. 'Compact2025, sometimes seen in the news, is related to
a) It is an initiative for ending hunger and under nutrition by 2025. 
b) It is an inifiative for increasing forest cover up to 30 percent all over tHe world by 2025.
c) It I  an initiative for the elimination of gender inequality by 2025. 
d) It is an initiative for increasing primary health coverage by 2025.
A
026. With reference to 'Consumer Confidence Survey', consider the following statements:
1. It is released by the Central Statistics Office (CSO)
2. This Survey is being used by the Reserve  Bank as one of the important  inputs for monetary  Policy formulation.
Which of the statements  given above is/are correct?
a) 1 only 
b) 2 only
c) Both 1 and 2
d) Neither 1 nor 2
AnswerB

Q27.With  reference to 'Liberalized  Remittance  Scheme  (LRS)" consider the following  statements:
1. It was launched  by the Ministry of Corporate  Affairs.
2. Regulations  for the scheme are provided  under the Foreign Contribution  (Regulation)  Act, 2010.
Which of the statements  gi  en a,bove  is/are correct?
a) 1 only 
b) 2 only
c) Both 1 and 2
d) Neither  j nor 2
AnswerD

'Q28) 'MQAD  (Mobile Application  for Desired Assistance  During travel)"  recently in the news is related to
a) Mohitorinq the Non-performing  assets (NPA) of banks
b) Monitoring  dropout  rate in primary schools 
c) Promotion of girl education  in India.
d) Expedite and streamline  passenger  grievance  redressal
D

029.  With reference  to 'Monetary  Policy Committee',  consider the following  statements:
1. The committee  was created in 2016 to bring transparency  and accountability  in fixing India's Fiscal Policy.                                ,
2. All members  of the committee  are nominated  by' the Gowefnment of India.
Which of the statements  given above is/are correct?
a) 1 only 
b) 2 only
c) Both 1 and 2
d) Neither 1 nor 2
AnswerD

030.  Consider the folloWing St9tements  about Advance  Pricing Agreement:
1. It is an agreemeht  between the taxpayer  and the tax authority regarding transfer. pricinq in the future.
2. The agreement  will be binding on both the taxpayer  and the tax authorities.
Whicti  of the above statement  is/are correct?
a) 1 only 
b)l2 only
c) Both 1 and 2
d) Neither 1 nor 2
 Answer c

Q31. Which of the following  sequence  is correct about share capital in Regional  Rural Banks?
a) Union Government>Sponsor   Bank>State Government
b) Sponsor  Bank>State  Government>Union Government
c) Union Government>State Government>Sponsor   Bank Government
A

Q32. Consider the following  sta ements about Atal Pension Yojana:
1. All workers  in the unorganized  sector up to the age of 60 years are eligible for the scheme.
2. On the death ef t  e subscriber, the spouse will receive 50%) of the normal pension amount.
Which of the above statement  is/are correct?
a) 1 only
b) 2 only
d) Neither  1 nor 2
AnswerD

Q33. Which of the following  statements  is incorrect about the e-way bill?
 a) It is mandatory  for interstate  movement  of goods of value more than Rs. 50,000 in motor vehicles.

b) Only GST registered  entities can register in the e-way bill portal.

c) The Validity of e-Way Bill is fixed as one day for eyery ~00 Krn.s
which can be extended.
d) A single e-way bill can be generated  for multiple conslqntnents.
AnswerB

034.'Cabotage   Law', recently seen in the news, is related to 
a) Shipping
b) Civil Aviation
c) Military Aviation
d) Space Exploration
AnswerA

035. Consider the following  statements  about 'Green bond'
1. The first Green bond was is~w'9dby the European  lnvestme   t Bank,{EIB)  in 2007.
2. The bond is voluhtary  and only issued by a financial  institution.
3. A Green bond is functionally  a debt instrument,  like any other bond.
Which of the statements  given above is/are correct?
a) 1 only
b) 1 and 3 only
c) 2 only
d) 1,2  and 3
Answer B

]
 

 



 





 























































 














