[
1. Consider  the following  statements  regarding Autonomous  and Accommodating  transactions  in BoP
1) Autonomous  items in BOP take place due to some economic motives like earning  income and profit maximization
2) Accommodating   items in BOP refer  0 transactions  that take place to cover deficit (or surplus)  arising from autonomous  transactions
Select the correct answer using the code given below. 
a) Only 1
b) Only 2
c) All of the above
d) None of the above
Ans: c


2. Look at the following  statements  about Nifty
1) It is toased upon 50 firms in India.
2) It is  regulated  by the Reserve Bank of India.
3) It does not trade in mutual funds
Select the correct answer using the code given below:
a) 1 only
b) 2 only
c) 3 only
d) 1 and  3
Ans:  a


3. J curve  in the  economics   is related  to
1) Index  is a type  of cost-of-living    index  that  uses  an expenditure function   such  as one  used  in assessing   expected   compensating
variation revenue   collected   by governments and  the amount   of tax
3) The  inverse  relationship    between   unemployment    rate  and  inflation
4) Refers  to the  trend  of a country's   trade  balance  following   a devaluation
Ans:  d

1) It is an economic   indicator   issued  daily  by the  London-based Baltic  Exchange
2) THey  are restricted   to Baltic  Sea  Countries

Select the  correct  answer   using  the  code  given  below. 
a) only   1
b) Only  2
c) All of the  above
d) None of the above
Ans: a


5. Consider  the following  about National Capital Goods policy
1) Department  of Heavy Industries  implements  it
2) It proposes for enhancing  the export of Indian made capital,goods
Which of the following  is/are correct?                                      /'
a) Only 1 
b) Only 2
c) Both 1 and 2
d) None of them
Ans: C


6. Tax buoyancy  is defined as
a) Percentage  change  in tax r:evenue in response to change  in tax rate and extension of coyer(ge
b) Refers to the %        change  in the tax revenue with the growth of national income i.e. growth based increase  in tax collection
c) The entity that bears the tax burden 
a) NOne of the above
Arts: b

7. Look at the following  statements  about chit funds
1) It is a saving institution
2) They have regular members who make periodical subscriptions  to the fund
3) Chit funds are included  in the definition  of Non- Banking Financial Companies
a) Only 1 and 2
b) Only 2 and 3 
c) Only 1 and 3
d) All of the above
Ans: d

8. Consider  the following  statements
1) Surcharge  is tax on tax
2) Cess in charge 0  the tax"
Which of the following is/are not correct?
a) Only 1
b) Only 2
c) All of the above
d) None of the above
Ans: c

9. Consider  the following  about International  Financial  Corporation
1) It lends money to the private sector companies  of the member nations
2) It encourages  foreign investment  in developing  economies  by offering insurance  to foreign  private investors  against loss caysed  by non-commercial  risks
Which of the following  is/are not correct?
a) Only 1
b) Only 2
c) Both 1 and 2 
d) None of them
Answer:  b

10. Gender audgetjng  is
a) Funds are allocated  only to the schemes  that support women development
b) Allocation  of resources to the agencies  are done by periodic re­
evaluation  through  incrementalism
c) Funtts and responsibilities  are allocated  on the basis of gender d) None of them
Answer:  c

11. Consider  the following  about Islamic Banking/  No-Interest Banking
1) It is prescribed  in the Sharia law
2) It prohibits  interests only on loans Which of the following  is/are correct?
a) Only 1
b) Only 2
c) All of the above
d) None of the above
Answer:  a

12. GDR means:
a) 'Gross domestic  ratio' which is a macro aggregate
b) 'Global  Depository  Receipt  which is (h~ mechanism  to raise funds from international  market
c) 'Global development  range',which  has been set up by UNO for developing  countries            ,.
d) 'Geographically  developed  regions' as defined  by the UNDP
Ans: b

13. Consider the following  about Goods and Service Tax
1) It r   a qestination  based tax
2) All the goods will be taxed at same rate
Which of the following  is/are correct?
a) Only 1
b) Only 2
c) Both 1 and 2
d) None of them
Ans: a

14. Recession  is
a) An economic  contraction  when the GOP declines fer 2 consecutive  years
b) An economic  boom when the GOP increases for Q consecutive years
c) An economic  contraction  when the GOP deBIj,Aesfor 2 consecutive  quarters d) None of them 
Answer:  c

15. Consider the following  statem, ents  about GAAR
1) It was first discussed  in  budget 2016-2017
2) It is an anti avoidance  Rule of India.
3) It is framed  by the Department  of Expenditure Which of the statements  given above are correct? 
a)onIy 1
b) Only 2
c) Only 1 and 3
d) All of the above
Ans: b

 16. Consider the following  taxes of the central government:
1) Personal  Income Tax
2) Corporation  Tax
3) Excise Duty
The descending  order of their allocation  size in the 2015-16 b,udgets
IS:                                                                                                                            ~
a)1,2,3 
b)1,3,4 
c) 2, 1,3
d) 2, 3, 1
Ans: a

17. The oil price is falling due to following  reasons
1) Demand is low. because of'weak  economic  activity
2) America  n0W imp0rts rnw6h less than in past due to shale gas exploration
3) Saudis and their Gulf allies have decided  not to sacrifice their own market share to restore the price

d) More supply of petrol due to discoveries  in Mid Africa
Select the correct answer using the code given below. 
a) 1 and 2 only
b) 1,2 and 3 only
c) 2, 3 and 4 only
d) All of the above
Answer:  b


18. The ideal recommended  ratio of NPK is
a)4:2: 1
b)2:4: 1 
c) 4: 1: 2
d)4:3:2
Ans: a

19. Consider the following  statements  with respect to repo rates
1) Rate at which central bank (RBI) lends money to commercial  bank for short term liquidity needs.
2) Increase  in repo rate helps in controlling  inflation
Which of the following  is/ace cpfrect?
a) Only 1
b) Only 2
c) All of the above
d) Nene of the above
Ans: c

20. eonsider  the following  about Call Money Market
1) It is an inter-bank  money market where funds are borrowed  and lent for one day
2) Collateral  is required to borrow money from this market
 Select the correct answer using the code given below. 
 a) Only 1
b) Only 2
c) All of the above
d) None of the above
Ans: a

21. The word Dirigisme  relates to 
a) Complete  Capitalism
b) Complete  control of economy  by state
c) Positive role of state invention  in economy
d) None of the above
Ans: c

22. Consider the following  eq.uations
1. Budget deficit= Total expenditure-  Total Receipts
2. Primary deficit=  Fiscal deficit- Interest payments
Select the correct option
a) Only 1
b) Only 2
c) All of the above
d) None of the above
Answer:  c

23. Consider the following  statements
1) Primary sector hosts majority of workers
2) Unemployment  is more in urban than in rural Which of the statements  given above are correct?
a) Only 1
b) Only 2
c) All of the above
d) None of the above
Ans: c

24. Oeendayal  Upadhyay  Shramev  Jayate Karyakrarn  does not include which?
a) Apprentice  Protsahan Yojana
b) Pradhan  Mantri Rozgar Protsahan  Yojana
c) Revamped  Rashtriya Swas>hya Sima Yojana
d) Universal Account  NU[llb~r
Ans: b

25. Look the following  statements  about real exchange  rate
1) It is taken as a measure of a country's  international competitiveness
2) It refers to the relative price of goods
3)1t has bearing on export and imports of the country
Which of the statements  given above are correct?
a) Only 1 and 2
b) Only  2 and  3 
c) Only  1 and  3
d) All of the above
Ans: d

26. Palma ratio is?
a. It is the ratio of richest 10% of the population  share of gfi6ss national income divided by the poorest 40% share
b. It is the ratio of the poorest 40%) of the J!)opulatiomshare of gross national income divided by the richest 10%>share
c. It is the ratio of the richest  1O~o of the population  share of gross national income divided by the poorest 6(9% share
d. None of the above

27. Which are the qualitative  te€,hniques  used in monetary  policy
1) Open market operations  
2) Credit Rationing
3) Moral Suasion

Which of the techniques  given above are correct?
aj Only 1 and 2 
b) Only 2 and 3
c) only  1 and 3
d) All of the above
Ans: b


28. Which of the following  are money market instruments?
1) Equity
2) Fully and partially convertible  debentures
3) Shares
Select the correct answer using the code given below.
a) Only 1
b) 1 and 2 
c) 1 and 3
d) None of them
Ans: d

29. The objectives  of Gove nment budget are?
1) Economic  Stability
2) Redistribution  of income and wealth
3) Allocation  of resources
Which of the statements  given above are correct?
a) Only 1 and 2
b) Only 2 and 3 
c) Only 1 and 3
d) All of the above

30. Revenue  expenditure  does not include one of these
a) Interest payment
b) Infrastructure  development 
c) Major subsidies
d) Defence expenditure
Ans: b

31. Consider the following  statements
1) Stocks are defined over a period of time
2) Flows are defined over a particular  point ofitirne
Which of the following  is/are correct?
a) Only 1 
b) Only 2
c) All of the above
d) None of them
Ans: d  

32. With respect to Ancbor  Investor, consider the following statements
1) He is the first investor in any round that provides subsequent investors a degree  of confidence
2) Anc  or investors  belong to the Qualified  Institutional  Buyers
Select the correct answer using the code given below.
a) Only 1 
b) Only 2
 c) All of the above
d) None of the above
Ans: c

33. The Gross National Happiness  does not have one o~these as its components.
a) Higher real per capita income.
b) Uninterrupted  growth and develop me 
c) Environmental  Protection.
d) Cultural  Promotion  (Le. inculcation  of etfiiGal,and spiritual  values in life without which,  it says, proQress may become  a curse rather than a blessing).
Ans: b

34. Look at the following  s1a emynts  about Vittiya SaksharataAbhiyan                                     ?
1) It is a Program tp create awareness  about sanitation  with the help of celebrities
2) Under it, youngs tudents  and faculty  members will be roped to encourage motivate  people
3) MIfIOstr.¥of Sanitation  and Drinking water launched  it and is irnplerrrentinq agency
Which of the statements  given above is/are correct?
a) Only 1 and 3
b) Only 2
c) Only 2 and 3
d) None of the above
Ans: b

35. The Macro-Economic  Vulnerability  index includes
1) Fiscal Deficit
2) Current Account  Deficit
3) Inflation
a) Only 1 and 2
b) Only 2 and 3
c) Only 1 and 3
d) All of the above
Ans: d                 

36. Read the follo"Ying statements  carefully  and choose the right answer by using the codes given below:
1) A 'procyclical  fiscal policy means reducing spending  and raising taxes durin:g '8 boom period, and increasing  spending/cutting  taxes duriflQ a recession.
2)  'countercyclical'   procyclical  fiscal policy' can be summarized simply as governments  choosing  to increase public spending  and reduce taxes during an economic  boom, but reduce spending  and increase taxes during a recession.
a) Only 1
b) Only 2
c) All of the above
d) None of the above
Ans: d

37. With reference to core of the core Schemes,  consider the ,
following  statements                                                                   )/
1) The funding  is in the ration 75:25
2) MGNREGA  is included  in the classification
3) Development  of Backward  Classes  and otQervulnerable   groups are not included
Select the correct answer using the code given below.
a) Only 1 and 2
Ans: a

38. RBI had constituted  the Deepak Mohanty committee  to examine the e~isting policy regarding financial  inclusion.  Its recommendations included  Augment  the government  social cash transfer
2) Step up account opening for females  belonging to lower incomegroup
3) Provide credit guarantees  in niche areas for Micro and Small Enterprises
4) Government  should provide more subsidies  to prevent farmer suicides
a) Only 1, 2 and 3
b) Only 2,3  and 4
c) Only 1, 3 and 4 
d) All of the above 
Ans: a

39. With respect to Deputy Governor  of RBI, consider the following statements
1) The RBI has'follr  deputy povemors
2) A central ba  k lS>eput'yGovernor  can be appointed  for a term with a maximum  of five years or till the age of 60
Select the correct-answer  using the code given below.
a) Only 1
b)only 2
c) AIl of the above
d) None of the above
Ans: a
 
40. Consider the following  statements  regarding  Non Scheduled banks
1) They are subject to Cash reserve requirement
2) They are not entitled to borrow from the RBI for norma! banking
purposes
Select the correct answer using the code given below. 
a) Only 1
b) Only 2
c) All of the above
d) None of the above
Ans: c


41. With reference to Special  Mention Account,  consider the following  statements
1) SMA-O Principal or intere~( payment  not overdue for more than 30 days but account sho   ing signs of incipient stress
2) SMA-1 Principal or interest payment overdue  between 31-60 days
3) SMA-2 Principal  or interest payment overdue  between 61-90 days

select 'the correct answer using the code given below.
a) only 1 and 2
b) Only2 and 3
c) Only 1 and 3
d) All of the above
Ans: d
 
42. Read the following  statements  carefully  and choose the incorrect answers  by using the codes given below:
1) Sampoorna  Sima Gram (SSG) Yojana provides affordable  life insurance  services to people, particularly  those living in rural areas of the country
2) Ministry of Rural development  launched the scheme
3) The benefits of Postal life Insurance will be conflhed to government  and semi government  empleyees  onl~
a) Only 1 and 2
b) Only 2 and 3 
c) Only 1 and 3
d) All of the above
Ans: b

43. With reference  to Nation,al  Investment  Fund (NIF), consider the
following  statements
1) Purpose  the fund was to receive disinvestment  proceeds of central public sector enterprises  and to invest the same to generate earrunqs
2)earnings   of the Fund were to be used for selected  Central social welfa(e  Schemes
3) Fund is part of consolidated  fund of India
Select the correct answer using the code given below.
a) Only 1 and 2
b) Only 2 and 3
c) Only 1 and 3
d) All of the above
Ans: a

 44. Read the following  statements  carefully:
1) A micro enterprise  in manufacturing  sector has investment than five lakh rupees     
2) A small enterprise  in Service  Sector 'las investmerit  less than five crore rupees
3) A medium enterprise  in manufacturing  sector has investment  less than ten crore rupees
Choose the right answer by using the codes given below
b) Only 1 and 2
c) Only 2 and 3
Ans: c

45. Look a(the  following  statements  about Financial  and Business Cycle
1) Business  cycle is the fluctuation  in economic  activity but in the fina  cial cycle financial  disruptions  tend to be long
2) 'The scope of financial  cycle is wider than the business cycle and has deep impact on the global economy
Which of the statements  given above is/are correct?
a) Only 1 
b) Only 2
c) All of the above
d) None of the above
Ans: c

46. The Chakravyuha  Challenge  present in economic  survif{  speaks about
2. Issue of Exit from the market
Select the incorrect answer using the codes given below:
a) 1 only 
b) 2 only
c) Both 1 and 2
d) None of the above,
Ans: a




47  consider. the following  statements  with respect to reverse charge
1) The  iability to pay tax is by the recipient of goods/services  instead of toe supplier.
2) Reverse  charge may be applicable  for services only Select the correct answer using the code given below. 
a) Only 1
b) Only 2
c) All of the above
d) None of the above
Ans: a

48. Aaykar  Setu which is seen in news is related to
a) It is a private limited company floated to aid the r-ollout of-1he new indirect tax regime
b) It allows user or taxpayers  to execute the provisions  of GST through  the online platform.
c) App launched  by CBDT that allows entities track TDS, pay taxes and apply for permanent  account number (PAN)
d) A desk that will explain the benefits of GST to small businessmen and answer their query
Ans: C                                   ,


49. With respect to GaQital Output Ratio, consider the following statements
1) It is the amount-of  capital needed to produce one unit of output
2) Higher level of COR means capital is efficiently  employed  in the country
Select the correct answer using the code given below.
a) only 1
b) Only 2
C) All of the above
d) None of the above
Ans: a

50. Which of the following  statements  about Offer for sale is correct?
1) OFS is an auction and the proceeds go to promoters  
2) OFS defines a price band within which bids should be paced
a) Only 1                                                                                  /'
b) Only 2
C) All of the above
d) None of the above
Ans: a

51. Consider the following  statements about Green GOP:
1. Green GOP refers to the GOP that includes the cost accrued to environmental  damage.
2. It takes int0 account the U'sage of non-renewable  sources  of energy.
Which of the above statements  are correct? 
A) 1 only
B) 2  only
C) Both 1 and 2
d)either  1 nor 2
Answer:  C

52. Consider the following  statements  about Inflation:
1. Headline  Inflation measures the price rise in food, fuel and all other commodities.
2. Core Inflation does not measure  price rise in fuel and food articles. Which of the above statements  are correct?
A) 1 only
B) 2 only
C) Both 1 and 2
D) Neither 1 nor 2
Answer:  C

53. Which of the following  can be causes af Inflation?
1. Increase  in population
2. Increase  in income levels of tAe population
3. Enhanced  Governrneri   Exp,ehditure
A) 2 only
B) 2 and 30flly
C) 1 and 3 only,
D) All  the above
Answer: d

54. Consider the following  statements  about Balance of Payments:
1. Balance of Payments  comprises  of Current account and Capital account.
2. Capital account  is broader compared  to Current account.
Which of the above statements  are correct?
A) 1 only
B) 2 only
C) Both 1 and 2
D) Neither 1 nor 2
Answer:  C

55. Consider the following  statements  about Conso~dation  of Public Sector Banks:
1. It will help in bringing down the NPAs of Banks.
2. It will result in more efficiency  due to sost cutting and scaling of operations.
Which of the above statemeQts are correct?
D) Neither 1 nor 2
Answer.: C


56.      nsider the following  statements  about financial  markets in India:
1. Money market deals in short term credit transactions  with a maturity up to one year.
2. Money market does not directly deal in cash or money but provides a market for credit instruments.
Which of the above statements  are correct?
A) 1 only
B) 2 only
C) Both 1 and 2
D) Neither 1 nor 2
Answer:  C
]
